output_vec

____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
input_1 (InputLayer)             (None, 10)            0
____________________________________________________________________________________________________
input_2 (InputLayer)             (None, 10)            0
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 10, 100)       1360800     input_1[0][0]
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 10, 100)       1360800     input_2[0][0]
____________________________________________________________________________________________________
lstm_1 (LSTM)                    (None, 128)           117248      embedding_1[0][0]
____________________________________________________________________________________________________
lstm_2 (LSTM)                    (None, 128)           117248      embedding_2[0][0]
____________________________________________________________________________________________________
add_1 (Add)                      (None, 128)           0           lstm_1[0][0]
                                                                   lstm_2[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 100)           12900       add_1[0][0]
====================================================================================================
Total params: 2,968,996
Trainable params: 247,396
Non-trainable params: 2,721,600
____________________________________________________________________________________________________
tamaki@tamaki-ubuntu:~/M1/Keras/mine2017_8to11$












loss_graph

____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
input_1 (InputLayer)             (None, 10)            0
____________________________________________________________________________________________________
input_2 (InputLayer)             (None, 10)            0
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 10, 100)       1360800     input_1[0][0]
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 10, 100)       1360800     input_2[0][0]
____________________________________________________________________________________________________
lstm_1 (LSTM)                    (None, 128)           117248      embedding_1[0][0]
____________________________________________________________________________________________________
lstm_2 (LSTM)                    (None, 128)           117248      embedding_2[0][0]
____________________________________________________________________________________________________
add_1 (Add)                      (None, 128)           0           lstm_1[0][0]
                                                                   lstm_2[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 13607)         1755303     add_1[0][0]
====================================================================================================
Total params: 4,711,399
Trainable params: 1,989,799
Non-trainable params: 2,721,600
____________________________________________________________________________________________________








('ladislaus', 157)
('habriot', 157)
('wladislaus', 157)
('fahkr', 157)
('ausfrid', 156)
('radulf', 156)
('spartacist', 156)
('rkisyrj', 156)
('yorkist', 156)
('bogislaus', 156)


